MiEcosystem/mijia_ble/demos/NXP/mible_std_authen/NXPQN980X/bm/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPI:
- options: {coreID: cm4}
- pin_list:
  - {pin_num: '16', peripheral: FLEXCOMM2, signal: SCK, pin_signal: GPIOA29/ACMP1N/ETM_TRACEDAT2/CTIMER3_MAT0/FC2_SCK/FC3_MISO/SPIFI_IO2}
  - {pin_num: '18', peripheral: FLEXCOMM2, signal: SCL_MISO, pin_signal: GPIOA27/USB_DM/SCT0_IN1/CTIMER1_MAT2/FC2_SCL_MISO/QDEC0_B/BLE_IN_PROC}
  - {pin_num: '22', peripheral: FLEXCOMM2, signal: SCL_SSEL1, pin_signal: SWDIO/GPIOA23/SCT0_IN3/CTIMER3_MAT1/FC2_SCL_SSEL1/FC3_SSEL2/QDEC1_B}
  - {pin_num: '19', peripheral: FLEXCOMM2, signal: SDA_MOSI, pin_signal: GPIOA26/USB_DP/SCT0_IN0/CTIMER1_MAT0/FC2_SDA_MOSI/QDEC0_A/BLE_SYNC}
  - {pin_num: '23', peripheral: FLEXCOMM2, signal: SDA_SSEL0, pin_signal: SWCLK/GPIOA22/SCT0_IN2/CTIMER3_MAT0/FC2_SDA_SSEL0/FC3_SSEL3/QDEC1_A, identifier: ''}
  - {pin_num: '43', peripheral: FLEXCOMM2, signal: SSEL2, pin_signal: GPIOA11/ADC7/SCT0_IN3/CTIMER1_MAT2/FC2_SSEL2/ACMP1_OUT/BLE_RX}
  - {pin_num: '24', peripheral: FLEXCOMM2, signal: SSEL3, pin_signal: GPIOA21/QDEC1_B/SCT0_OUT0/CTIMER2_MAT1/FC2_SSEL3/FC1_CTS_SDA/SPIFI_CSN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : BOARD_InitSPI
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void BOARD_InitSPI(void) {
  SYSCON->PIO_FUNC_CFG[1] = ((SYSCON->PIO_FUNC_CFG[1] &
    (~(SYSCON_PIO_FUNC_CFG_PA11_FUNC_MASK)))                 /* Mask bits to zero which are setting */
      | SYSCON_PIO_FUNC_CFG_PA11_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN11 (coords: 43) is configured as FC2_SSEL2 */
    );
  SYSCON->PIO_FUNC_CFG[2] = ((SYSCON->PIO_FUNC_CFG[2] &
    (~(SYSCON_PIO_FUNC_CFG_PA21_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA22_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA23_FUNC_MASK))) /* Mask bits to zero which are setting */
      | SYSCON_PIO_FUNC_CFG_PA21_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN21 (coords: 24) is configured as FC2_SSEL3 */
      | SYSCON_PIO_FUNC_CFG_PA22_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN22 (coords: 23) is configured as FC2_SDA_SSEL0 */
      | SYSCON_PIO_FUNC_CFG_PA23_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN23 (coords: 22) is configured as FC2_SCL_SSEL1 */
    );
  SYSCON->PIO_FUNC_CFG[3] = ((SYSCON->PIO_FUNC_CFG[3] &
    (~(SYSCON_PIO_FUNC_CFG_PA26_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA27_FUNC_MASK | SYSCON_PIO_FUNC_CFG_PA29_FUNC_MASK))) /* Mask bits to zero which are setting */
      | SYSCON_PIO_FUNC_CFG_PA26_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN26 (coords: 19) is configured as FC2_SDA_MOSI */
      | SYSCON_PIO_FUNC_CFG_PA27_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN27 (coords: 18) is configured as FC2_SCL_MISO */
      | SYSCON_PIO_FUNC_CFG_PA29_FUNC(PIO_FUNC_ALT4)         /* PORTA PIN29 (coords: 16) is configured as FC2_SCK */
    );
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

